cf_billing/Documents/бестУстановитьГруппуПотребителейНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестУстановитьГруппуПотребителейНП</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бестТарифныеКатегорииНП</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТарифныеКатегорииУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяКатегория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/бестТарифныеКатегорииНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестТарифныеКатегорииНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТарифнаяКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Documents/бестУстановитьГруппуПотребителейНП/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;

	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	Ответственный = Пользователи.ТекущийПользователь();
		
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Отказ тогда
		Возврат;
	КонецЕсли;

	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	ДанныеШапки  = ДанныеШапки();
	
	бестПроведениеСерверНП.ВыполнитьДвижения(ДанныеШапки,Движения.бестТарифныеКатегорииНП,"ТарифныеКатегорииУслуги");  
		
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если Не ЗначениеЗаполнено(ТарифныеКатегорииУслуги) тогда 
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("ТЧ не может быть пустой");	
	Иначе 
		Для Каждого СтрокаТЧ из ТарифныеКатегорииУслуги цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Услуга) и НЕ ЗначениеЗаполнено(СтрокаТЧ.ТарифнаяКатегория) Тогда
				Отказ 		= Истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + СтрокаТЧ.НомерСтроки + " не заполнено поле ""Тарифная категория""",ЭтотОбъект,"ТарифныеКатегорииУслуги["+(СтрокаТЧ.НомерСтроки-1)+"].ТарифнаяКатегория");				
			КонецЕсли;			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеШапки()
	ДанныеШапки = Новый Структура;	
	ДанныеШапки.Вставить("Период",					?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата));
	ДанныеШапки.Вставить("Район",					Район);
	ДанныеШапки.Вставить("Организация",				Организация);	
	ДанныеШапки.Вставить("МКД",						ОбъектРасчета.МКД);
	ДанныеШапки.Вставить("ОбъектРасчета",			ОбъектРасчета);
	ДанныеШапки.Вставить("ПериодРегистрации",		Дата);
	ДанныеШапки.Вставить("ПериодНачисления",		ПериодНачисления);
	ДанныеШапки.Вставить("ТарифныеКатегорииУслуги",	ТарифныеКатегорииУслуги);	

	Возврат ДанныеШапки; 	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
